# ============================================================
# Taps
# ============================================================

# ============================================================
# CLI Tools
# ============================================================

# Shell & terminal
brew "atuin"
brew "bat"
brew "btop"
brew "coreutils"
brew "duti"
brew "fzf"
brew "jless"
brew "lazygit"
brew "sd"
brew "starship"
brew "thefuck"
brew "tmux"
brew "vivid"
brew "watch"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"

# Version control & GitHub
brew "gh"
brew "git"

# Languages & runtimes
brew "go"
brew "lua-language-server"
brew "node"
brew "python@3.14"
brew "rbenv"
brew "ruby"
brew "ruby-build"
brew "uv"

# DevOps & infra
brew "cmake"
brew "container"
brew "kubernetes-cli"
brew "kubectx"
brew "krew"

# Data & databases
brew "jq"
brew "yq"
brew "sqlite"

# Networking & HTTP
brew "curl"
brew "httpie"
brew "ssh-copy-id"
brew "telnet"
brew "wget"

# Media
brew "ffmpeg"

# Search
brew "the_silver_searcher"

# Misc
brew "buf"
brew "chezmoi"
brew "duti"
brew "gnupg"
brew "gum"
brew "mas"
brew "ncdu"

# ============================================================
# Casks (GUI apps)
# ============================================================
cask "1password"
cask "1password-cli"
cask "alfred"
cask "claude"
cask "container"
cask "discord"
cask "docker-desktop"
cask "ghostty"
cask "hammerspoon"
cask "karabiner-elements"
cask "visual-studio-code"
cask "vlc"

# ============================================================
# Mac Store
# ============================================================
mas "Amphetamine", id: 937984704      # keep awake
mas "Hidden Bar", id: 1452453066      # menu bar cleanup
mas "Tailscale", id: 1475387142       # already have CLI in brew too
mas "Clocks", id: 414554506

{{ if eq .machine_type "work" -}}
mas "Slack", id: 803453959
{{ else -}}
mas "djay Pro", id: 450527929
mas "Developer", id: 640199958
mas "Moofin", id: 6761283970
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835


{{ end -}}
