tap 'homebrew/cask-cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'buo/cask-upgrade'

brew 'brew-cask-completion'
brew 'composer'
brew 'coreutils'
brew 'duti'
brew 'elixir'
brew 'findutils', args: ['with-default-names']
brew 'fish'
brew 'git'
brew 'glib'
brew 'go'
brew 'graphviz'
brew 'hub'
brew 'httpie'
brew 'jq'
brew 'kubectl'
brew 'kubernetes-cli'
brew 'mas'
brew 'mongodb'
brew 'nginx'
brew 'node'
brew 'openssl'
brew 'pipenv'
brew 'postgresql'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'tmux'
brew 'vcprompt'
brew 'watch'
brew 'wget'

cask 'alfred'
cask 'battle-net'
cask 'brave-browser'
cask 'cleanmymac'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'font-hack-nerd-font'
cask 'font-inconsolata'
cask 'google-chrome'
cask 'iterm2'
cask 'java8'
cask 'popsql'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'sublime-merge'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'

mas 'Amphetamine', id: 937984704
mas '1Password', id: 1333542190
mas 'Magnet', id: 441258766
mas 'Clocks', id: 414554506
