tap 'homebrew/bundle'
tap 'buo/cask-upgrade'
tap 'homebrew/cask-fonts'
tap 'heroku/brew'

brew 'brew-cask-completion'
brew 'composer'
brew 'duti'
brew 'elixir'
brew 'fish'
brew 'git'
brew 'glib'
brew 'go'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'krew'
brew 'kubectl'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'mas'
brew 'nginx'
brew 'node'
brew 'openssl'
brew 'pipenv'
brew 'postgresql@14'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'tmux'
brew 'vcprompt'
brew 'watch'
brew 'wget'
brew 'yq'

cask 'cleanmymac'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'font-hack-nerd-font'
cask 'font-inconsolata'b
cask 'google-chrome'
cask 'hammerspoon'
cask 'iterm2'
cask 'karabiner-elements'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'

mas '1Password', id: 1333542190
mas 'Clocks', id: 414554506
